IDEA StatiCa Open Model
CheckResBolt.LoadCaseId Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Id of Load Case
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public int LoadCaseId { get; set; }
Public Property LoadCaseId As Integer
	Get
	Set
public:
property int LoadCaseId {
	int get ();
	void set (int value);
}
Property Value
Type: Int32
See Also
Reference
CheckResBolt Class
IdeaRS.OpenModel.Connection Namespace